Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: It’s important to note that when you’re using `git svn`, you’re interacting with Subversion, which is a system that is far less sophisticated than Git.
cs: V tomto místě bych rád upozornil, že použijete-li příkaz `git svn`, zahajujete interakci se systémem Subversion, nástrojem zdaleka ne tak sofistikovaným jako Git.

source: It’s important to note that with the exception of the HTTP protocols, all of these require Git to be installed and working on the server.
cs: Neměli bychom zamlčet ani to, že s výjimkou protokolu HTTP všechny vyžadují, aby byl na serveru nainstalován a zprovozněn systém Git.

source: It’s important to notice that it isn’t the SHA of the commit, but of the blob itself:
cs: Je tedy důležité si uvědomit, že se nejedná o SHA revize, ale SHA samotného blobu:

source: It’s important to remember that unlike Git, which requires you to merge upstream work you don’t yet have locally before you can push, `git svn` makes you do that only if the changes conflict.
cs: Za zmínku stojí, že na rozdíl od systému Git, který před přijetím odesílaných dat vyžaduje, abyste začlenili práci na serveru, kterou ještě nemáte lokálně, nástroj `git svn` si toto vyžádá pouze v případě, že změny navzájem kolidují.

source: It’s important to remember when you’re doing all this that these branches are completely local.
cs: Při tom všem, co nyní děláte, je důležité mít na paměti, že všechny tyto větve jsou čistě lokální.

source: It’s incredibly fast, it’s very efficient with large projects, and it has an incredible branching system for non-linear development (See Chapter 3).
cs: Je extrémně rychlý, velmi efektivně pracuje i s velkými projekty a nabízí skvělý systém větvení pro nelineární způsob vývoje (viz kapitola 3).

source: It’s like a branch reference, but it never moves — it always points to the same commit but gives it a friendlier name.
cs: Podobá se také referenci větve, jen se nikdy nepřesouvá. Stále ukazuje na stejnou revizi, jen jí dává hezčí jméno.

source: It’s like a very small rebase — don’t amend your last commit if you’ve already pushed it.
cs: Je to něco jako malé přeskládání – neopravujte poslední revizi, pokud jste ji už odeslali.

source: It’s more like the last known state of the commits on the Subversion server.
cs: Jedná se tak spíše o poslední známý stav revizí na serveru Subversion.

source: It’s much easier to create Git objects this way than to run the raw Git commands or try to write the raw objects (see Chapter 9 for more information).
cs: Je podstatně jednodušší vytvořit objekty Git tímto způsobem než spouštět syrové příkazy Git či se pokoušet zapsat syrové objekty (podrobnější informace v kapitole 9).

source: It’s nice that you can fetch namespaced references that way, but how does the QA team get their branches into a `qa/` namespace in the first place?
cs: Je sice hezké, že můžete tímto způsobem vyzvedávat reference na základě jmenného prostoru, jenže jak vůbec QA tým dostane své větve do jmenného prostoru `qa/`?

source: It’s now time to learn some Git basics.
cs: Nejvyšší čas podívat se na základy práce se systémem Git.

source: It’s often helpful to get a review of all the commits that are in this branch but that aren’t in your master branch.
cs: Často může být užitečné získat přehled o všech revizích, které jsou obsaženy v určité větvi, ale dosud nejsou ve vaší hlavní větvi.

source: It’s possible to make Git push over HTTP as well, although that technique isn’t as widely used and requires you to set up complex WebDAV requirements.
cs: Odesílat data do repozitáře Git je možné také přes protokol HTTP, avšak tento způsob není příliš rozšířený a vyžaduje nastavení komplexních požadavků protokolu WebDAV.

source: It’s pretty easy on your part.
cs: Není to nic obtížného.

source: It’s pushed and pulled with the rest of your project.
cs: Soubor se odesílá a stahuje se zbytkem projektu.

source: It’s sometimes referred to as the index, but it’s becoming standard to refer to it as the staging area.
cs: Soubor se někdy označuje také anglickým výrazem „index“, ale oblast připravených změn (staging area) je už dnes termín běžnější.

source: It’s strange, but it works.
cs: Je to sice trochu zvláštní, ale opravdu to tak funguje.

source: It’s the most popular open source VCS and has been around for nearly a decade.
cs: Subversion je nejpopulárnějším systémem VCS s otevřeným zdrojovým kódem a využívá se už téměř deset let.

source: It’s time to e-mail your mailing list of people who want to know what’s happening in your project.
cs: Nyní je na čase obeslat e-mailem poštovní konferenci lidí, kteří chtějí vědět, co je ve vašem projektu nového.

source: It’s used to inspect the snapshot that’s about to be committed, to see if you’ve forgotten something, to make sure tests run, or to examine whatever you need to inspect in the code.
cs: Slouží ke kontrole snímku, který hodláte zapsat. Může zjišťovat, zda jste na něco nezapomněli, spouštět kontrolní testy nebo prověřovat cokoli jiného, co potřebujete ve zdrojovém kódu zkontrolovat.

source: It’s used to pull in topic branches (short-lived branches, like your earlier `iss53` branch) when they’re ready, to make sure they pass all the tests and don’t introduce bugs.
cs: Do ní se vtahují tématické větve (ty dočasné, jako byla vaše větev `iss53`) ve chvíli, kdy jsou připravené a je jisté, že projdou všemi testy a nezavlečou chyby.

source: It’s very easy for patches or other collaborated work to introduce subtle whitespace changes because editors silently introduce them or Windows programmers add carriage returns at the end of lines they touch in cross-platform projects.
cs: U záplat nebo jiné společné práce dochází u prázdných znaků velmi snadno k nepatrným změnám, které v tichosti vytvářejí editory nebo programátoři pracující ve Windows, jež vkládají v projektech z jiných platforem na konce řádků znak pro návrat vozíku (CR, http://cs.wikipedia.org/wiki/Carriage_return).

source: It’s worth mentioning that this changes your remote branch names, too.
cs: Za zmínku stojí, že tímto příkazem změníte zároveň i názvy vzdálených větví.

source: It’s worth noting here that the work you did in your `hotfix` branch is not contained in the files in your `iss53` branch.
cs: Za zmínku stojí, že práce, kterou jste udělali ve větvi `hotfix`, není obsažena v souborech ve větvi `iss53`.

source: It’s worth pointing out that Git determines the best common ancestor to use for its merge base; this is different than CVS or Subversion (before version 1.5), where the developer doing the merge has to figure out the best merge base for themselves.
cs: Na tomto místě bych chtěl zopakovat, že Git určuje nejvhodnějšího společného předka, který bude použit jako základna pro sloučení, automaticky. Liší se tím od systému CVS i Subversion (před verzí 1.5), kde musí vývojář při slučování najít nejvhodnější základnu pro sloučení sám.

source: I’ll cover aspects of each of these in a series of use cases, moving from simple to more complex; you should be able to construct the specific workflows you need in practice from these examples.
cs: Všem těmto aspektům bych se teď chtěl věnovat na sérii praktických příkladů, od těch jednodušších až po složité. Z uvedených příkladů byste si pak měli být schopni odvodit vlastní pracovní postup, který budete v praxi využívat.

source: I’ll cover most of the major hook filenames here.
cs: V dalších částech se budeme věnovat většině nejvýznamnějších názvů souborů zásuvných modulů.

source: I’ll demonstrate how to send a patch via Gmail, which happens to be the e-mail agent I use; you can read detailed instructions for a number of mail programs at the end of the aforementioned `Documentation/SubmittingPatches` file in the Git source code.
cs: Já budu dokumentovat odeslání záplaty na příkladu Gmailu, který používám jako svého e-mailového agenta. Podrobné instrukce pro celou řadu poštovních programů najdete na konci již dříve zmíněného souboru `Documentation/SubmittingPatches` ve zdrojovém kódu systému Git.

source: I’ll demonstrate setting up the Perforce Visual Merge Tool (P4Merge) to do your diffs and merge resolutions, because it’s a nice graphical tool and it’s free.
cs: Já na tomto místě ukážu, jak můžete pro zobrazení rozdílů a řešení konfliktů využít nástroj Perforce Visual Merge Tool (P4Merge). Jde o šikovný grafický nástroj a je dostupný zdarma.

source: I’ll go over all these plumbing commands in detail in Chapter 9; but for now, here’s what that command gives you:
cs: Všem těmto nízkoúrovňovým příkazům se budu podrobněji věnovat v kapitole 9. Pro tuto chvíli se jen podívejme, co příkazem získáme:

source: I’ll go over the strengths and possible weaknesses of each design; you can choose a single one to use, or you can mix and match features from each.
cs: Uvedeme jejich přednosti i eventuální slabiny. Budete si moci vybrat některý z postupů nebo je navzájem kombinovat a spojovat jejich vlastnosti.

source: I’ll use path names in the examples that work on Mac and Linux systems; for Windows, you’ll have to change `/usr/local/bin` to an executable path in your environment.
cs: V příkladech budu používat označení cest platné pro systémy Mac a Linux; pro systémy Windows budete muset cestu `/usr/local/bin` nahradit cestou ke spustitelnému souboru ve vašem prostředí.

source: I’ll use the Mac path for the executable; in other systems, it will be where your `p4merge` binary is installed.
cs: Jako cestu ke spustitelnému souboru používám cestu v systému Mac. V ostatních systémech použijte cestu k umístění, kde máte nainstalován binární soubor `p4merge`.

source: I’ve mentioned and given some demonstrations of adding remote repositories in previous sections, but here is how to do it explicitly.
cs: V předchozích částech už jsem se letmo dotkl přidávání vzdálených repozitářů. V této části se dostávám k tomu, jak přesně při přidávání postupovat.

source: Jessica can now merge this into the work she did with `git merge`:
cs: Nyní může Jessica začlenit tyto změny do své práce pomocí příkazu `git merge`:

source: Jessica doesn’t have push access to the `master` branch — only the integrators do — so she has to push to another branch in order to collaborate with John:
cs: Jessica nemá oprávnění pro odesílání dat do větve `master` (ten mají pouze zprostředkovatelé integrace), a proto musí své revize odeslat do jiné větve, aby mohla s Johnem spolupracovat:

source: Jessica e-mails John to tell him that she’s pushed some work into a branch named `featureA` and he can look at it now.
cs: Jessica pošle Johnovi e-mail s informací, že odeslala svou práci do větve pojmenované `featureA` a že se na ni může podívat.

source: Jessica first needs to merge those changes in with her own before she can push to the server.
cs: Než bude Jessica moci odeslat svou práci na server, bude do ní nejprve muset začlenit práci Josie.

source: Jessica thinks her topic branch is ready, but she wants to know what she has to merge her work into so that she can push.
cs: Jessica považuje svou tematickou větev za dokončenou, ale chce vědět, do čeho má svou práci začlenit, aby mohla změny odeslat.

source: Jessica wants to sync up with John, so she fetches:
cs: Jessica chce synchronizovat svou práci s Johnem, a proto vyzvedne jeho data:

source: Jessica wants to tweak something, so she commits again and then pushes this back up to the server:
cs: Jessica by ráda něco vylepšila, a proto vytvoří novou revizi a odešle ji zpět na server:

source: Jessica, Josie, and John inform the integrators that the `featureA` and `featureBee` branches on the server are ready for integration into the mainline.
cs: Jessica, Josie a John pošlou zprávu zprostředkovatelům integrace, že větve `featureA` a `featureBee` jsou na serveru připraveny k integraci do hlavní linie.

source: Jessica’s commit history now looks something like Figure 5-13.
cs: Historie revizí Jessicy bude nyní vypadat jako na obrázku 5-13.

source: Jessica’s history after committing on a feature branch.
cs: Historie Jessicy po zapsání revizí do větve s úkolem

source: Jessica’s history after fetching John’s changes.
cs: Historie Jessicy po vyzvednutí Johnových změn

source: Jessica’s history after merging John’s changes.
cs: Historie Jessicy po začlenění Johnových změn

source: Jessica’s history after merging both her topic branches.
cs: Historie Jessicy po začlenění obou jejích tematických větví

source: Jessica’s history after pushing all changes back to the server.
cs: Historie Jessicy po odeslání všech změn zpět na server

source: Jessica’s history now looks like Figure 5-8.
cs: Historie revizí Jessicy teď vypadá jako na obrázku 5-8.

source: Jessica’s initial commit history.
cs: Výchozí historie revizí – Jessica

source: Jessica’s repository looks like Figure 5-12.
cs: Repozitář Jessicy vypadá jako na obrázku 5-12.

source: John has a reference to the changes Jessica pushed up, but he has to merge them into his own work before he is allowed to push:
cs: John má referenci ke změnám, které odeslala Jessica, ale než bude moci sám odeslat svá data, bude muset začlenit její práci:

source: John has to fetch Jessica’s changes and merge them in before he will be allowed to push:
cs: John musí vyzvednout změny, které provedla Jessica, a začlenit je do své práce, než ji bude moci odeslat:

source: John isn’t allowed to push because Jessica has pushed in the meantime.
cs: John nyní nesmí odeslat revize, protože mezitím odeslala své změny Jessica.

source: John tries to push his change up, too:
cs: Také John se pokusí odeslat své změny na server:

source: John’s history after pushing to the origin server.
cs: Johnova historie po odeslání revize na server origin

source: John’s initial repository.
cs: Johnův výchozí repozitář

source: John’s repository after merging `origin/master`.
cs: Johnův repozitář po začlenění větve `origin/master`

source: Just for fun, you’ll add the first tree as a subdirectory into this one.
cs: Jen pro zábavu nyní můžete přidat první strom jako podadresář do tohoto stromu.

source: Just to have a target, assume that each message has to include a string that looks like "ref: 1234" because you want each commit to link to a work item in your ticketing system.
cs: Abychom si stanovili nějaký cíl, řekněme, že každá zpráva musí obsahovat řetězec ve tvaru „ref: 1234“, protože potřebujete, aby se každá revize vztahovala k jedné pracovní položce vašeho tiketovacího systému.

source: Just type `git tag`:
cs: Stačí zadat příkaz `git tag`:

source: Keeping all users’ public keys in the `authorized_keys` file for access works well only for a while.
cs: Uchovávat veřejné klíče všech uživatelů v souboru `authorized_keys` není uspokojivým řešením na věčné časy.

source: Key-based SSH authentication usually enforces security by requiring restricted rights on the involved files.
cs: Autentizace vůči SSH, která je založená na klíči, obvykle vynucuje zvýšenou bezpečnost tím, že pro zúčastněné soubory vyžaduje omezená oprávnění.

source: Last we have the HTTP protocol.
cs: Na konec jsme si nechali protokol HTTP.

source: Last, like the Git and Local protocols, SSH is efficient, making the data as compact as possible before transferring it.
cs: A stejně jako protokoly Git a Local je i protokol SSH výkonný, protože data jsou před přenosem upravena do co nejkompaktnější podoby.

source: Last, we’ll go over a few hosted options, if you don’t mind hosting your code on someone else’s server and don’t want to go through the hassle of setting up and maintaining your own server.
cs: Nakonec se podíváme na několik možností hostování pro případ, že nebudete mít chuť podstupovat martyrium s nastavováním a správou vlastního serveru a nevadí vám umístit svůj kód na cizí server.

source: Lastly, you have this:
cs: A na konci stojí následující:

source: Let us say, in the situation above, we want engineers to be able to rewind any branch _except_ master and integ.
cs: Řekněme, že ve výše uvedené situaci budeme chtít, aby skupina engineers mohla vracet změny v jakékoliv větvi _s výjimkou_ větví `master` a `integ`.

source: Let’s add the rest of the team.
cs: Nyní přidáme zbytek vašeho týmu.

source: Let’s assume you’ve received a few keys by e-mail and saved them to temporary files.
cs: Předpokládejme, že jste e-mailem dostali několik klíčů a uložili jste je do dočasných souborů.

source: Let’s change a file that was already tracked.
cs: Nyní provedeme změny v souboru, který už byl sledován.

source: Let’s create a hotfix branch on which to work until it’s completed (see Figure 3-13):
cs: Vytvořme větev s hotfixem, v níž budeme pracovat, dokud nebude oprava hotová (viz obrázek 3-13):

source: Let’s do what it says:
cs: Uděláme, co nám výpis radí:

source: Let’s follow Jessica’s workflow as she works on her two features, collaborating in parallel with two different developers in this environment.
cs: Sledujme pracovní postup Jessicy pracující na dvou úkolech a spolupracující v tomto prostředí paralelně s dvěma různými vývojáři.

source: Let’s follow the `http-fetch` process for the simplegit library:
cs: Podívejme se na proces `http-fetch` pro knihovnu „simplegit“:

source: Let’s get into using some Git.
cs: Je načase začít systém Git aktivně používat.

source: Let’s get rid of it.
cs: Proto ho raději odstraníme.

source: Let’s go back to the objects database for your test Git repository.
cs: Vraťme se zpět do databáze objektů vašeho testovacího repozitáře Git.

source: Let’s go through a simple example of branching and merging with a workflow that you might use in the real world.
cs: Vytvořme si jednoduchý příklad větvení a slučování s pracovním postupem, který můžete využít i v reálném životě.

source: Let’s look at an example of how rebasing work that you’ve made public can cause problems.
cs: Podívejme se na malý příklad, jaké problémy může přeskládání již zveřejněných dat způsobit.

source: Let’s look at one more possible scenario: the maintainer has looked at work in your second branch and likes the concept but would like you to change an implementation detail.
cs: Podívejme se ještě na jeden pravděpodobnější scénář: Správce se podíval na práci ve vaší druhé větvi, váš koncept se mu líbí, ale rád by, abyste změnili jeden implementační detail.

source: Let’s make a few changes and commit again:
cs: Proveďme pár změn a zapišme další revizi:

source: Let’s re-add the public keys for John, Josie, and Jessica:
cs: Přidejme znovu veřejné klíče pro uživatele Johna, Josie a Jessicu:

source: Let’s run `git add` now to stage the `benchmarks.rb` file, and then run `git status` again:
cs: Spusťme nyní příkaz `git add`, abychom soubor `benchmarks.rb` připravili k zapsání, a potom znovu zadejme příkaz `git status`:

source: Let’s say that John and Jessica are working together on one feature, while Jessica and Josie are working on a second.
cs: Řekněme, že John a Jessica spolupracují na jednom úkolu a Jessica a Josie spolupracují na jiném.

source: Let’s say the project maintainer has pulled in a bunch of other patches and tried your first branch, but it no longer cleanly merges.
cs: Řekněme, že správce projektu natáhl do projektu několik jiných záplat a nyní vyzkoušel vaši první větev, jenže tu už nelze čistě začlenit.

source: Let’s say you add a new file to your project, a simple `README` file.
cs: Řekněme, že nyní přidáte do projektu nový soubor, například soubor `README`.

source: Let’s say you create a new branch called testing.
cs: Řekněme, že vytvoříte novou větev a nazvete ji testing.

source: Let’s say you decide to pull in your server branch as well.
cs: Řekněme, že se později rozhodnete vtáhnout i větev server.

source: Let’s say you edit and stage the `README` file again and then edit the `benchmarks.rb` file without staging it.
cs: Řekněme, že znovu upravíte a připravíte soubor `README` a poté bez připravení upravíte soubor `benchmarks.rb`.

source: Let’s say you have a Git server on your network at `git.ourcompany.com`.
cs: Řekněme, že máte v síti server Git označený `git.ourcompany.com`.

source: Let’s say you just pushed out a release of your code to a production environment, you’re getting bug reports about something that wasn’t happening in your development environment, and you can’t imagine why the code is doing that.
cs: Řekněme, že jste právě odeslali vydání svého zdrojového kódu do produkčního prostředí, ale dostanete hlášení o chybě, která se ve vašem vývojovém prostředí nevyskytovala, a nemáte tušení, proč kód takto zlobí.

source: Let’s say you’ve set up a server called `git.example.com` that you have SSH access to, and you want to store all your Git repositories under the `/opt/git` directory.
cs: Řekněme, že jste nastavili server nazvaný `git.example.com`, k němuž máte SSH přístup, a všechny svoje repozitáře Git chcete uložit do adresáře `/opt/git`.

source: Let’s see how much space you saved.
cs: Podívejme se, kolik místa jste ušetřili.

source: Let’s see what it might look like when two developers start to work together with a shared repository.
cs: Podívejme se, jak to může vypadat, když dva vývojáři začnou spolupracovat na projektu se sdíleným repozitářem.

source: Let’s see why you should do so.
cs: Podívejme se, proč byste to měli dělat také tak.

source: Let’s switch back to the `master` branch:
cs: Přepněme zpět na větev `master`.

source: Let’s switch to the new testing branch:
cs: My můžeme přepnout na novou větev testing:

source: Let’s take a minute to look at how Git stores its objects.
cs: Zaměřme se teď chvíli na to, jak Git ukládá své objekty.

source: Let’s use `gitserver` as the hostname of the server on which you’ve set up your 'git' user and repository.
cs: Pro server, na kterém jste nastavili uživatele 'git' a repozitář, můžeme použít název hostitele `gitserver`.

source: Let’s walk through setting up SSH access on the server side.
cs: Projděme si nastavení SSH přístupu na straně serveru.

source: Let’s work from the previous example.
cs: Můžeme pokračovat v našem předchozím příkladu.

source: Lieutenants merge the developers’ topic branches into their master branch.
cs: Poručíci začleňují tematické větve vývojářů do svých hlavních větví.

source: Like many other Version Control Systems, Git has a way to fire off custom scripts when certain important actions occur.
cs: Stejně jako jiné systémy správy verzí přistupuje i Git k tomu, že spouští uživatelské skripty, nastane-li určitá důležitá akce.

source: Like most VCSs, Git has the ability to tag specific points in history as being important.
cs: Stejně jako většina systémů VCS nabízí i Git možnost označovat v historii určitá místa, jež považujete za důležitá.

source: Listing the available tags in Git is straightforward.
cs: Pořízení výpisu dostupných značek (tags) je v systému Git jednoduché.

source: Local Git commits that you haven’t dcommited don’t show up; neither do commits that people have made to the Subversion server in the meantime.
cs: Nezobrazuje tedy lokální revize Git, které jste nezapsali příkazem dcommit. Stejně tak nezobrazuje revize, které ostatní zapsali na server Subversion od vašeho posledního připojení.

source: Local VCS systems suffer from this same problem—whenever you have the entire history of the project in a single place, you risk losing everything.
cs: Lokální systémy pro správu verzí trpí stejným problémem. Kdykoliv máte celou historii projektu uloženou na jednom místě, hrozí, že přijdete o vše.

source: Local version control diagram.
cs: Diagram lokální správy verzí

source: Look back at the example commit history in Figure 6-1.
cs: Podívejme se ještě jednou na příklad historie revizí na obrázku 6-1.

source: Looking at your Git status again, you can see that you’ve unstaged the TODO file:
cs: Pokud se nyní znovu podíváte na stav Git souboru TODO, uvidíte, že už není připraven k zapsání:
